ДипломнаяБаза/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ДипломнаяБаза/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЗначениеЗаполнено(Объект.СписокДоговоров) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьСозданиеДокументовРеализацияТоваровИУслуг",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Список добавленных в таблицу документов будет очищен." + Символы.ПС, + "Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет );
	Иначе
		ВыполнитьСозданиеДокументовРеализацияТоваровИУслуг(КодВозвратаДиалога.Да, Новый Структура);
	КонецЕсли;
		
	//старый код из БСП 12-2
	//ДлительнаяОперация = ЗаполнитьНаСервере();
	//ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	//ПараметрыОжидания.Интервал = 1;
	//ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	//ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении",ЭтотОбъект);
	//ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОЗавершении,ПараметрыОжидания);
	//конец старого кода из БСП 12-2
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСозданиеДокументовРеализацияТоваровИУслуг(РезультатВыбора, ДопПараметры) Экспорт

	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		
		Если ЗначениеЗаполнено(Объект.Период) Тогда
			
			НачалоПериода = НачалоМесяца(Объект.Период.ДатаНачала);
			КонецПериода = КонецМесяца(Объект.Период.ДатаОкончания);
	
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
			ПараметрыОжидания.Интервал = 1;
			ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		
			ОповещениеОЗавешении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
			ОповещениеОПрогрессе = Новый ОписаниеОповещения("ОповещениеОПрогрессе", ЭтотОбъект);
			ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессе;
			
			МассивСозданныхДокументов = ЗаполнитьНаСервере(НачалоПериода, КонецПериода);
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(МассивСозданныхДокументов, ОповещениеОЗавешении, ПараметрыОжидания);
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо заполнить период для автосоздания документов!";
			Сообщение.Сообщить();
			
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаполнитьНаСервере(НачалоПериода, КонецПериода)
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьСозданиеДокументовРеализация", НачалоПериода, КонецПериода,);
		
	Возврат ДлительнаяОперация;

КонецФункции 

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
	
		МассивСозданныхДокументов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
			Если МассивСозданныхДокументов.Количество() <> 0 Тогда
			
				Объект.СписокДоговоров.Очистить();
				
				Для Каждого СозданныйДокумент Из МассивСозданныхДокументов Цикл
					НоваяСтрока = Объект.СписокДоговоров.Добавить();
					НоваяСтрока.Договор = СозданныйДокумент.Договор;
					НоваяСтрока.Реализация = СозданныйДокумент.РеализацияТоваровИУслуг;
				КонецЦикла;
				
				Сообщения = Результат.Сообщения;
				
				Если Сообщения.Количество() <> 0 Тогда
				
					Для каждого Сообщение Из Сообщения Цикл
						
						Сообщить(Сообщение);
						
					КонецЦикла;
										
				КонецЕсли;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Документы успешно созданы. Количество созданных документов: %1", МассивСозданныхДокументов.Количество());
				Сообщение.Сообщить();
												
			Иначе
				
				Объект.СписокДоговоров.Очистить();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Данные для создания новых документов отсутствуют.";
				Сообщение.Сообщить();
			
			КонецЕсли;
		
	КонецЕслИ;
				
	
КонецПроцедуры 

&НаКлиенте
Процедура ОповещениеОПрогрессе(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если Прогресс.Прогресс <> Неопределено Тогда
	
		Состояние("Прогресс: ", Прогресс.Прогресс.Процент);
		
	КонецЕслИ;
	
КонецПроцедуры
